docs/kissing-is-hard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-20 Sat 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kissing is hard.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Diego Rodriguez" />
</head>
<body>
<div id="content">
<h1 class="title">Kissing is hard.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org22ee3a7">1. Notes</a></li>
<li><a href="#org8997bc8">2. Variants</a></li>
</ul>
</div>
</div>

<div id="outline-container-org22ee3a7" class="outline-2">
<h2 id="org22ee3a7"><span class="section-number-2">1</span> Notes</h2>
<div class="outline-text-2" id="text-1">
<p>
KISS (<i>Keep it simple stupid</i>) is a design principle that favors simplicity
over complication (complication ≠ complexity). Achieving simplicity in design
is not easy. Simple can be easy, but it can also be hard&#x2014;as explained by the
creator of the Clojure programming language<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
I tried creating a (git-based) repository as an attempt to create a
version-controlled knowledge base system. The system was based on plain-text
files. But, after trying it for days, I found that having to <code>commit</code> changes
often makes the note-taking process cumbersome. This is not ideal; any system
intended for information capturing (i.e. knowledge base system) should <i>get
out of the way</i>. Especially if the system is for productivity purposes.
</p>

<p>
Nevertheless, alternative systems based on modern mobile applications and
websites are not saints either. I have tried them too. They get in the way, in
their own way. Notifications, application updates, <i>spammy</i> marketing emails,
in existent or limited (formatting) options, excessive resource usages, etc.
are all fraction of the problems that current services have. All of these are
problems present in many current tools.
</p>

<p>
While there are systems that seem to be good enough, such as Google Calendar
and Google Tasks, they make you dependent on the company that made them&#x2014;or
worse, an addict on the product itself. This is dangerous, not only because it
messes with the dopamine receptors in your brain, but because it could drive
you away from your original mission: focus and mindfulness. But also, since
their code is not open-source, adding features you want is unnecessarily
harder. Of course, some might argue that this is something that only us&#x2014;the
computer literates&#x2014;should worry about. Everyone else should just use what
companies give them. I think the approach is wrong. We are living the
transition to the Information Age. Just like in the past we transitioned to a
better society and people learned to read, write, and do math; it is time for
us to learn to read, write, and do code. Even Steve Jobs thought this. He was
a visionary not only in the business realm.
</p>

<p>
If there is anything that I have learned from software engineering and
personal relationships is that, sometimes, you do not want to become too
dependent on certain software or certain people. And if you do, make sure you
<i>really</i> trust them.
</p>

<p>
The tech industry status quo is that you either need to <a href="https://www.google.com/calendar/about/">depend on a
third-party</a>, you have to use complex solutions, or both at the same time.
What's fascinating is that during the personal computer revolution many tools
that solve most of our problems were invented (and they are free!). In fact,
once I used a 1980s tool to solve a OCR problem for a company. Most of the
work was integrating with a modern AWS-based workflow. In that case, I
depended on software that passed the test of time and, like with friendships,
I tend to trust you way more if you've been loyal and accountable for decades
rather than months.
</p>

<p>
I get why people would go so far to use (and advocate) for current tools that
depend on having a smartphone (sometimes with <i>high-speed</i> mandatory Internet
access). Even if those tools clearly limit them. Because using those tools is
<i>easy</i>. Making things easy is a way of making something that people want.
Thus, a way to make money. That is what Amazon did to buying online, Coinbase
to buying cryptocurrencies, and Shopify to build an online business. This is
why these companies are drowning in fiat, or even crypto, now.
</p>

<p>
Some people would argue that some tools make them <i>effective</i>. But, these very
same people were as effective&#x2014;if not more&#x2014;when they used paper-based
agendas in school as kids. They needn't Asana, Trello, or Notion. Only pencil
and paper. And the role models they idolize work that way too. I agree with
Steve in that the computer is supposed to be a bycicle for the mind. It is not
supposed to be an elevator.
</p>

<p>
Big achievers are known for their fond relationship with simplicity. For
example, Paul Graham, arguably one of the best investors in the Silicon Valley
area is known to use <code>vi</code> for, well, everything<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Most would disregard
this argument since Paul Graham is a hacker and, thus, knows how to use
computers. There is truth to both sides of the argument. I find it hard to
explain it better than Alan Kay on his paper "The Power of Context":
</p>

<blockquote>
<p>

</p>

<p>
Thus, virtually all the PARC hardware&#x2014;including two big time-sharing main
frames, the Altos, Ethernet, Laserprinter, file storage, and the systems
that followed&#x2014;and software&#x2014;including operating systems, programming
languages and development systems, productivity tools, etc.&#x2014;were
completely built inhouse by these few dozen researchers.
</p>

<p>
This sounds disastrous, but there is an important collection of theories in
which the 1st order version and the 2nd order version are completely
different yet both are true. For example, in programming there is a
wide-spread 1st order theory that one shouldn't build one's own tools,
languages, and especially operating systems. This is true—an incredible
amount of time and energy has gone down these ratholes. On the 2nd hand, if
you can build your own tools, languages and operating systems, then you
absolutely should because the leverage that can be obtained (and often the
time not wasted in trying to fix other people's not quite right tools) can
be incredible.
</p>

<p>
&#x2014;Alan Kay
</p>
</blockquote>

<p>
Leonardo Da Vinci once said that <i>simplicity is the ultimate sophistication</i>;
Ludwig Mies van der Rohe said <i>less is more</i>. Many other variants from other
extraordinary individuals are available in the <a href="#org8997bc8">Variants</a> section.
</p>

<p>
Nonetheless, I do not need to go that far to see the greatness in simplicity.
My first boss made a living creating virtual spaces for architects. He did an
outstanding job and, while everybody may not have enjoyed working with him,
everybody loved his works. The funny thing is that most of his works was made
of boxes and lines. If you have ever used a 3D modeling and rendering
software, you will immediately notice that there will be many primitives that
you can use. Spheres, tubes, geo-spheres, cones, pyramids, etc. And that's
only standard 3D primitives. Yet, here was a man who made a living based in
2021 using mainly boxes and lines<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. Primitives that were available since
the initial release of the software in 1996.
</p>

<p>
To be honest, I still think that plain-text files and <code>git</code> are a great idea.
I believe these two <i>lego</i> pieces can be used to create a marvelous
note-taking and planning system and more. I just need to figure out how.
</p>

<p>
For now, however, I will be using a simple local folder with <code>.org</code> files (no
version control) and evolve from there.
</p>
</div>
</div>

<div id="outline-container-org8997bc8" class="outline-2">
<h2 id="org8997bc8"><span class="section-number-2">2</span> Variants</h2>
<div class="outline-text-2" id="text-2">
<p>
Variants of the KISS principle by many authors:
</p>

<ul class="org-ul">
<li>Bjarne Stroustrup → <i>Make Simple Tasks Simple</i></li>
<li>Albert Einstein (allegedly) → <i>Make everything as simple as possible, but
not simpler</i></li>
</ul>

<p>
Corollary of the KISS principle and its variants: <i>do not make Rube Goldberg
machines</i>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.youtube.com/watch?v=oytL881p-nQ">Simple Made Easy</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://twitter.com/paulg/status/1381948532421226500">Just run <code>fmt</code> bro</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
In the particular software that he was using, 3ds max, <i>lines</i> were named
after the mathematical functions named <i>splines</i>.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Diego Rodriguez</p>
<p class="date">Created: 2021-11-20 Sat 23:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
